Req Res/ac.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header>
      <work:WorkContext xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXekABx3ZWJsb2dpYy5hcHAuRkNVQlNBY2NTZXJ2aWNlAAAA1gAAACN3ZWJsb2dpYy53b3JrYXJlYS5TdHJpbmdXb3JrQ29udGV4dAALMTIuMC4zLjUuMTAAEndlYmxvZ2ljLmFwcC5HV0VKQgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQACzEyLjAuMy41LjEwAAA=</work:WorkContext>
   </S:Header>
   <S:Body>
      <QUERYCUSTACC_IOFS_RES xmlns="http://fcubs.ofss.com/service/FCUBSAccService">
         <FCUBS_HEADER>
            <SOURCE>FLEXCUBE</SOURCE>
            <UBSCOMP>FCUBS</UBSCOMP>
            <MSGID/>
            <CORRELID/>
            <USERID>ADCUSER</USERID>
            <BRANCH>001</BRANCH>
            <SERVICE>FCUBSAccService</SERVICE>
            <OPERATION>QueryCustAcc</OPERATION>
            <SOURCE_OPERATION/>
            <DESTINATION>ADC</DESTINATION>
            <FUNCTIONID>STDCUSAC</FUNCTIONID>
            <ACTION>EXECUTEQUERY</ACTION>
            <MSGSTAT>SUCCESS</MSGSTAT>
            <ADDL/>
         </FCUBS_HEADER>
         <FCUBS_BODY>
            <Cust-Account-Full>
               <BRN>001</BRN>
               <ACC>0011102147213001</ACC>
               <CUSTNO>1021472</CUSTNO>
               <ACCLS>RSCPRS</ACCLS>
               <ACCLASSDESC>REGULAR SAVING COOPERATIVE ASSOCIATIONS,PRIVATE AND INDIVIDUALS AND STAFF</ACCLASSDESC>
               <CCY>ETB</CCY>
               <CUSTNAME>ANTENEH TADESSE ABEBE</CUSTNAME>
               <ACCLSTYP>S</ACCLSTYP>
               <ADESC>ANTENEH TADESSE ABEBE</ADESC>
               <ACSTATNODR>Y</ACSTATNODR>
               <ACSTATNOCR>Y</ACSTATNOCR>
               <ACSTATSTPAY>N</ACSTATSTPAY>
               <DORM>Y</DORM>
               <ACCTYPE>S</ACCTYPE>
               <ACCOPENDT>2013-07-29</ACCOPENDT>
               <ALTACC>1010402309</ALTACC>
               <FROZEN>N</FROZEN>
               <ADDRESS_1>A.A</ADDRESS_1>
               <ADDRESS_2>YEKA</ADDRESS_2>
               <ADDRESS_3>3/2/2004</ADDRESS_3>
               <ADDRESS_4>1625</ADDRESS_4>
               <POSTALLOWED>Y</POSTALLOWED>
               <CLRBNKCD>XYZAAA</CLRBNKCD>
               <CLRACNO>0011102147213001</CLRACNO>
               <TRKREC>N</TRKREC>
               <REFREQ>N</REFREQ>
               <ACCSTAT>NORM</ACCSTAT>
               <STATSINCE>2013-07-29</STATSINCE>
               <INHERITREP>N</INHERITREP>
               <AUTOSTATCHANGE>N</AUTOSTATCHANGE>
               <DORMPRM>M</DORMPRM>
               <LOC>AA</LOC>
               <MEDIA>MAIL</MEDIA>
               <CHQBOOK>N</CHQBOOK>
               <PASSBOOK>Y</PASSBOOK>
               <CASACC>N</CASACC>
               <MT210REQD>N</MT210REQD>
               <AUTOREORDERCHKREQ>N</AUTOREORDERCHKREQ>
               <LODGEBKFAC>N</LODGEBKFAC>
               <ALLWBKPERENTRY>Y</ALLWBKPERENTRY>
               <AUTOPROVREQ>N</AUTOPROVREQ>
               <PROVCCYTYPE>L</PROVCCYTYPE>
               <DEFRECON>N</DEFRECON>
               <CONSREQD>N</CONSREQD>
               <FUNDING>N</FUNDING>
               <ATM>Y</ATM>
               <ACSTMTTYPEP>N</ACSTMTTYPEP>
               <DISPIBANINADV>N</DISPIBANINADV>
               <ACSTMTTYPS>N</ACSTMTTYPS>
               <ACSTMTTYPE3>N</ACSTMTTYPE3>
               <FLGEXCLRVRTRANS>N</FLGEXCLRVRTRANS>
               <SWPTYPE>1</SWPTYPE>
               <REGDAPP>N</REGDAPP>
               <REGDPER>N</REGDPER>
               <PRDLST>D</PRDLST>
               <TXNLST>D</TXNLST>
               <SPCONDLST>N</SPCONDLST>
               <SPCONDTXN>N</SPCONDTXN>
               <ODREQ>N</ODREQ>
               <DAYLIGHTLIMIT>0</DAYLIGHTLIMIT>
               <WAIVE_ACC_OPEN_CHARGE>N</WAIVE_ACC_OPEN_CHARGE>
               <COUNTRY_CODE>ET</COUNTRY_CODE>
               <ESCROWTRN>N</ESCROWTRN>
               <SALARY_ACCOUNT>N</SALARY_ACCOUNT>
               <REPL_CUST_SIG>Y</REPL_CUST_SIG>
               <ACCOUNTAUTOCLOSED>N</ACCOUNTAUTOCLOSED>
               <CRS_STST_REQD>N</CRS_STST_REQD>
               <PROJACC>N</PROJACC>
               <PRIVATE_CUSTOMER>N</PRIVATE_CUSTOMER>
               <LIMIT_AUTO_CREATE_POOL>N</LIMIT_AUTO_CREATE_POOL>
               <DFLT_WAIVER>N</DFLT_WAIVER>
               <AUTO_DEBIT_CARD_REQUEST>N</AUTO_DEBIT_CARD_REQUEST>
               <AUTO_CHEQUE_BOOK_REQ>N</AUTO_CHEQUE_BOOK_REQ>
               <INTERMEDIARY_REQUIRED>N</INTERMEDIARY_REQUIRED>
               <ENABLE_SWEEP_IN>Y</ENABLE_SWEEP_IN>
               <ENABLE_REV_SWEEP_IN>N</ENABLE_REV_SWEEP_IN>
               <SPDANLSYS>N</SPDANLSYS>
               <MAKER>FINUSER1</MAKER>
               <MAKERSTAMP>2015-12-01 15:40:54</MAKERSTAMP>
               <CHECKER>FINUSER1</CHECKER>
               <CHECKERSTAMP>2015-12-01 15:40:54</CHECKERSTAMP>
               <MODNO>1</MODNO>
               <TXNSTAT>O</TXNSTAT>
               <AUTHSTAT>A</AUTHSTAT>
               <Provision-Main>
                  <PRVACCUI>0011102147213001</PRVACCUI>
               </Provision-Main>
               <Accmaintinstr>
                  <BRN>001</BRN>
                  <ACC>0011102147213001</ACC>
                  <DTOFLSTMAINT>2015-12-01</DTOFLSTMAINT>
               </Accmaintinstr>
               <Interim-Details>
                  <GENINTRMSTMT>N</GENINTRMSTMT>
                  <GENINTRMSTMTMVMT>N</GENINTRMSTMTMVMT>
                  <GENBALRPT>N</GENBALRPT>
                  <BALRPTSINCE>950</BALRPTSINCE>
               </Interim-Details>
               <Acstatuslines>
                  <ACSTATUS>NORM</ACSTATUS>
                  <DRGL>2011020</DRGL>
                  <CRGL>2011020</CRGL>
                  <DESC>NORMAL STATUS</DESC>
               </Acstatuslines>
               <Intdetails>
                  <CALCACC>0011102147213001</CALCACC>
                  <BOOKACC>0011102147213001</BOOKACC>
                  <HASIS>N</HASIS>
                  <INTSTARTDT>2013-07-29</INTSTARTDT>
                  <BOOKACCBRN>001</BOOKACCBRN>
                  <DRCRADV>N</DRCRADV>
                  <CHGBOOKACCBRN>001</CHGBOOKACCBRN>
                  <CHGBOOKACC>0011102147213001</CHGBOOKACC>
                  <CHGSTARTDT>2013-07-29</CHGSTARTDT>
                  <BRN>001</BRN>
                  <ACC>0011102147213001</ACC>
                  <CONSOLCHGBRN>001</CONSOLCHGBRN>
               </Intdetails>
               <Tddetails>
                  <AUTOROLL>N</AUTOROLL>
                  <CLONMAT>N</CLONMAT>
                  <MOVINTUNCLM>N</MOVINTUNCLM>
                  <ROLLTYPE>P</ROLLTYPE>
                  <MOVPRIUNCLM>N</MOVPRIUNCLM>
                  <INTSTDT>2013-07-29</INTSTDT>
               </Tddetails>
               <Amount-Dates>
                  <LCY>ETB</LCY>
                  <ACY>ETB</ACY>
                  <DR_INT_DUE>0</DR_INT_DUE>
                  <PROVAMT>0</PROVAMT>
                  <CHG_DUE>0</CHG_DUE>
                  <WITHDRAWABLE_UNCOLLED_FUND>0</WITHDRAWABLE_UNCOLLED_FUND>
                  <ACY_OPENING_BAL>0</ACY_OPENING_BAL>
                  <LCY_OPENING_BAL>0</LCY_OPENING_BAL>
                  <ACY_TODAY_TOVER_DR>0</ACY_TODAY_TOVER_DR>
                  <LCY_TODAY_TOVER_DR>0</LCY_TODAY_TOVER_DR>
                  <ACY_TODAY_TOVER_CR>0</ACY_TODAY_TOVER_CR>
                  <LCY_TODAY_TOVER_CR>0</LCY_TODAY_TOVER_CR>
                  <ACY_TANK_CR>0</ACY_TANK_CR>
                  <ACY_TANK_DR>0</ACY_TANK_DR>
                  <LCY_TANK_CR>0</LCY_TANK_CR>
                  <LCY_TANK_DR>0</LCY_TANK_DR>
                  <ACY_TANK_UNCOLLECTED>0</ACY_TANK_UNCOLLECTED>
                  <ACY_CURR_BALANCE>0</ACY_CURR_BALANCE>
                  <LCY_CURR_BALANCE>0</LCY_CURR_BALANCE>
                  <ACY_BLOCKED_AMOUNT>0</ACY_BLOCKED_AMOUNT>
                  <ACY_AVL_BAL>0</ACY_AVL_BAL>
                  <ACY_UNAUTH_DR>0</ACY_UNAUTH_DR>
                  <ACY_UNAUTH_TANK_DR>0</ACY_UNAUTH_TANK_DR>
                  <ACY_UNAUTH_CR>0</ACY_UNAUTH_CR>
                  <ACY_UNAUTH_TANK_CR>0</ACY_UNAUTH_TANK_CR>
                  <ACY_UNAUTH_UNCOLLECTED>0</ACY_UNAUTH_UNCOLLECTED>
                  <ACY_UNAUTH_TANK_UNCOLLECTED>0</ACY_UNAUTH_TANK_UNCOLLECTED>
                  <ACY_ACCRUED_DR_IC>0</ACY_ACCRUED_DR_IC>
                  <ACY_ACCRUED_CR_IC>0</ACY_ACCRUED_CR_IC>
                  <DATE_LAST_CR_ACTIVITY>2017-02-08</DATE_LAST_CR_ACTIVITY>
                  <DATE_LAST_DR_ACTIVITY>2017-02-09</DATE_LAST_DR_ACTIVITY>
                  <DATE_LAST_DR>2017-02-09</DATE_LAST_DR>
                  <DATE_LAST_CR>2017-02-08</DATE_LAST_CR>
                  <ACY_UNCOLLECTED>0</ACY_UNCOLLECTED>
                  <DIS_UNUTILIZED_AMT>0</DIS_UNUTILIZED_AMT>
                  <DIS_TOT_AVL_AMOUNT>0</DIS_TOT_AVL_AMOUNT>
                  <ACY_UNAUTH>ETB</ACY_UNAUTH>
                  <UTILIZED_AMT>0</UTILIZED_AMT>
                  <LIMIT_AMOUNT>0</LIMIT_AMOUNT>
                  <ILM_SWEEP_BAL>0</ILM_SWEEP_BAL>
                  <SWEEP_ELIG_BAL>0</SWEEP_ELIG_BAL>
                  <PRINC_OUTSTAND>0</PRINC_OUTSTAND>
                  <INT_OUTSTAND>0</INT_OUTSTAND>
                  <CHG_OUTSTAND>0</CHG_OUTSTAND>
                  <Turnovers>
                     <ACY_MTD_TOVER_DR>0</ACY_MTD_TOVER_DR>
                     <LCY_MTD_TOVER_DR>0</LCY_MTD_TOVER_DR>
                     <ACY_MTD_TOVER_CR>0</ACY_MTD_TOVER_CR>
                     <LCY_MTD_TOVER_CR>0</LCY_MTD_TOVER_CR>
                     <ACY_TOV>ETB</ACY_TOV>
                     <LCY_TOV>ETB</LCY_TOV>
                  </Turnovers>
               </Amount-Dates>
               <Noticepref>
                  <BRN>001</BRN>
                  <ACC>0011102147213001</ACC>
               </Noticepref>
               <Tod-Renew>
                  <RNW_FLG>N</RNW_FLG>
               </Tod-Renew>
               <Cust-Acc-Check/>
               <Custacc>
                  <BRN>001</BRN>
                  <CUSTACNO>0011102147213001</CUSTACNO>
                  <Linkedentities>
                     <CUSTOMER>1021472</CUSTOMER>
                     <RELATIONSHIP>primary</RELATIONSHIP>
                     <INHERIT>N</INHERIT>
                     <CUSTNAME>ANTENEH TADESSE ABEBE</CUSTNAME>
                  </Linkedentities>
               </Custacc>
               <Custacc-Icccspcn>
                  <BRNCD>001</BRNCD>
                  <ACCNO>0011102147213001</ACCNO>
               </Custacc-Icccspcn>
               <Custacc-Icchspcn>
                  <BRN>001</BRN>
                  <ACC>0011102147213001</ACC>
               </Custacc-Icchspcn>
               <Custacc-Iccinstr>
                  <BRN>001</BRN>
                  <ACC>0011102147213001</ACC>
                  <Autodepdetails>
                     <SEQNO>1</SEQNO>
                  </Autodepdetails>
               </Custacc-Iccinstr>
               <CustAcc>
                  <BRN>001</BRN>
                  <ACC>0011102147213001</ACC>
                  <Misdetails>
                     <POOLCD>DFLTPOOL</POOLCD>
                     <REFRTTYPE>X</REFRTTYPE>
                     <CALCMETH>1</CALCMETH>
                     <TXNMIS1>STAFF</TXNMIS1>
                     <RTFLAG>P</RTFLAG>
                  </Misdetails>
               </CustAcc>
               <Custacc-Sicdiary/>
               <Custacc-Stccusbl>
                  <BRN>001</BRN>
                  <ACCNO>0011102147213001</ACCNO>
               </Custacc-Stccusbl>
               <UDFDETAILS>
                  <FLDNAM>GOLDEN_BASE_AMOUNT</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CIC_SECT_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CIC_AGRI_SUB_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CIC_CL_SUB_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CIC_DTS_SUB_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CIC_FI_SUB_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CIC_HOC_SUB_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CIC_IND_SUB_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CIC_INT_SUB_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>BROAD_CLS_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CASH_COLLATERAL_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>RENEGOTIATED_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>NONCASH_COLLATERAL_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>RESTRUCTURED_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>CAF_CLOSURE_REASON_OD</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>BILHAT_MIN_BAL</FLDNAM>
               </UDFDETAILS>
               <Acc-Svcacsig>
                  <ACBRN1>001</ACBRN1>
                  <ACTNO>0011102147213001</ACTNO>
                  <ACDESC>ANTENEH TADESSE ABEBE</ACDESC>
                  <ACCCY>ETB</ACCCY>
                  <Accsigdetails>
                     <CUST_ID>1021472</CUST_ID>
                     <RELATIONTYP>Authorised signatory</RELATIONTYP>
                     <SIGID>1021472</SIGID>
                     <SIGNAME>ENAT BANK</SIGNAME>
                     <SOLOSIG>0</SOLOSIG>
                  </Accsigdetails>
               </Acc-Svcacsig>
               <Custacc-Iccintpo>
                  <BRANCH_CODE>001</BRANCH_CODE>
                  <CUST_AC_NO>0011102147213001</CUST_AC_NO>
                  <CCY>ETB</CCY>
               </Custacc-Iccintpo>
               <Customer-Acc>
                  <BRANCH_CODE>001</BRANCH_CODE>
                  <CUST_AC_NO>0011102147213001</CUST_AC_NO>
               </Customer-Acc>
               <Customer-Accis>
                  <BRANCHCODE>001</BRANCHCODE>
                  <CUST_AC_NO>0011102147213001</CUST_AC_NO>
               </Customer-Accis>
               <Master>
                  <KEY_ID>001:0011102147213001</KEY_ID>
                  <FUNCTION_ID>STDCUSAC</FUNCTION_ID>
               </Master>
               <Sttms-Cust-Acc-Swp>
                  <BRANCH_CODE>001</BRANCH_CODE>
                  <CUST_AC_NO>0011102147213001</CUST_AC_NO>
               </Sttms-Cust-Acc-Swp>
            </Cust-Account-Full>
            <FCUBS_WARNING_RESP>
               <WARNING>
                  <WCODE>ST-SAVE-023</WCODE>
                  <WDESC>Record Successfully Retrieved</WDESC>
               </WARNING>
            </FCUBS_WARNING_RESP>
         </FCUBS_BODY>
      </QUERYCUSTACC_IOFS_RES>
   </S:Body>
</S:Envelope>




<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header>
      <work:WorkContext xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXf5ABx3ZWJsb2dpYy5hcHAuRkNVQlNBY2NTZXJ2aWNlAAAA1gAAACN3ZWJsb2dpYy53b3JrYXJlYS5TdHJpbmdXb3JrQ29udGV4dAALMTIuMC4zLjUuMTAAG3dlYmxvZ2ljLmFwcC5GQ1VCU1JUU2VydmljZQAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQACzEyLjAuMy41LjEwABJ3ZWJsb2dpYy5hcHAuR1dFSkIAAADWAAAAI3dlYmxvZ2ljLndvcmthcmVhLlN0cmluZ1dvcmtDb250ZXh0AAsxMi4wLjMuNS4xMAAA</work:WorkContext>
   </S:Header>
   <S:Body>
      <S:Fault xmlns:ns4="http://www.w3.org/2003/05/soap-envelope">
         <faultcode>S:Client</faultcode>
         <faultstring>Cannot find dispatch method for {http://fcubs.ofss.com/service/FCUBSAccService}QUERYCUSTACC_IOFS_RES</faultstring>
      </S:Fault>
   </S:Body>
</S:Envelope>